In [3]:
import pandas as pd

# use read_json to convert json to dataframe
df = pd.read_json('data/simple.json')

In [9]:
# print the whole dataframe table
df

     id   name  math  physics  chemistry
0  A001    Tom    60       66         61
1  A002  James    89       76         51
2  A003  Jenny    79       90         78

In [10]:
# print just the first row
df.loc[0]

id           A001
name          Tom
math           60
physics        66
chemistry      61
Name: 0, dtype: object

In [13]:
# print first to second row
df.loc[[0, 1]]

     id   name  math  physics  chemistry
0  A001    Tom    60       66         61
1  A002  James    89       76         51

In [5]:
# print dataframe info. fields with numbers are defaulted to int64 instead of object type
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         3 non-null      object
 1   name       3 non-null      object
 2   math       3 non-null      int64
 3   physics    3 non-null      int64
 4   chemistry  3 non-null      int64
dtypes: int64(3), object(2)
memory usage: 248.0+ bytes

In [6]:
# read_json can also convert json in a file located in a url
URL = 'http://raw.githubusercontent.com/BindiChen/machine-learning/master/data-analysis/027-pandas-convert-json/data/simple.json'
df = pd.read_json(URL)

In [7]:
df

     id   name  math  physics  chemistry
0  A001    Tom    60       66         61
1  A002  James    89       76         51
2  A003  Jenny    79       90         78

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         3 non-null      object
 1   name       3 non-null      object
 2   math       3 non-null      int64
 3   physics    3 non-null      int64
 4   chemistry  3 non-null      int64
dtypes: int64(3), object(2)
memory usage: 248.0+ bytes

In [14]:
import json
# load data using Python JSON module
with open('data/nested_array.json','r') as f:
    data = json.loads(f.read())
# Flatten data
df_nested_list = pd.json_normalize(data, record_path =['students'])

FileNotFoundError: [Errno 2] No such file or directory: 'data/nested_array.json'